{
  "class_name": "Model",
  "config": {
    "name": "model_1",
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            12
          ],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "input_2"
        },
        "name": "input_2",
        "inbound_nodes": []
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_4",
          "trainable": true,
          "dtype": "float32",
          "units": 1024,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_4",
        "inbound_nodes": [
          [
            [
              "input_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dropout",
        "config": {
          "name": "dropout_3",
          "trainable": true,
          "dtype": "float32",
          "rate": 0.1,
          "noise_shape": null,
          "seed": null
        },
        "name": "dropout_3",
        "inbound_nodes": [
          [
            [
              "dense_4",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_5",
          "trainable": true,
          "dtype": "float32",
          "units": 2048,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_5",
        "inbound_nodes": [
          [
            [
              "dropout_3",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dropout",
        "config": {
          "name": "dropout_4",
          "trainable": true,
          "dtype": "float32",
          "rate": 0.1,
          "noise_shape": null,
          "seed": null
        },
        "name": "dropout_4",
        "inbound_nodes": [
          [
            [
              "dense_5",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_6",
          "trainable": true,
          "dtype": "float32",
          "units": 1024,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_6",
        "inbound_nodes": [
          [
            [
              "dropout_4",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dropout",
        "config": {
          "name": "dropout_5",
          "trainable": true,
          "dtype": "float32",
          "rate": 0.1,
          "noise_shape": null,
          "seed": null
        },
        "name": "dropout_5",
        "inbound_nodes": [
          [
            [
              "dense_6",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_7",
          "trainable": true,
          "dtype": "float32",
          "units": 33,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_7",
        "inbound_nodes": [
          [
            [
              "dropout_5",
              0,
              0,
              {}
            ]
          ]
        ]
      }
    ],
    "input_layers": [
      [
        "input_2",
        0,
        0
      ]
    ],
    "output_layers": [
      [
        "dense_7",
        0,
        0
      ]
    ]
  },
  "keras_version": "2.2.4-tf",
  "backend": "tensorflow"
}